Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz2025dab176.h
extern volatile __GLCDCURDATA105bits_t GLCDCURDATA105bits __asm__ ("GLCDCURDATA105") __attribute__((section("sfrs"), address(0xBF8EA9A4)));
#define GLCDCURDATA106 GLCDCURDATA106
extern volatile uint32_t   GLCDCURDATA106 __attribute__((section("sfrs"), address(0xBF8EA9A8)));
typedef struct {
  uint32_t PIXEL2623:4;
  uint32_t PIXEL2622:4;
  uint32_t PIXEL2621:4;
  uint32_t PIXEL2620:4;
  uint32_t PIXEL2619:4;
  uint32_t PIXEL2618:4;
  uint32_t PIXEL2617:4;
  uint32_t PIXEL2616:4;
} __GLCDCURDATA106bits_t;
extern volatile __GLCDCURDATA106bits_t GLCDCURDATA106bits __asm__ ("GLCDCURDATA106") __attribute__((section("sfrs"), address(0xBF8EA9A8)));
#define GLCDCURDATA107 GLCDCURDATA107
extern volatile uint32_t   GLCDCURDATA107 __attribute__((section("sfrs"), address(0xBF8EA9AC)));
typedef struct {
  uint32_t PIXEL2631:4;
  uint32_t PIXEL2630:4;
  uint32_t PIXEL2629:4;
  uint32_t PIXEL2628:4;
  uint32_t PIXEL2627:4;
  uint32_t PIXEL2626:4;
  uint32_t PIXEL2625:4;
  uint32_t PIXEL2624:4;
} __GLCDCURDATA107bits_t;
extern volatile __GLCDCURDATA107bits_t GLCDCURDATA107bits __asm__ ("GLCDCURDATA107") __attribute__((section("sfrs"), address(0xBF8EA9AC)));
#define GLCDCURDATA108 GLCDCURDATA108
extern volatile uint32_t   GLCDCURDATA108 __attribute__((section("sfrs"), address(0xBF8EA9B0)));
typedef struct {
  uint32_t PIXEL277:4;
  uint32_t PIXEL276:4;
  uint32_t PIXEL275:4;
  uint32_t PIXEL274:4;
  uint32_t PIXEL273:4;
  uint32_t PIXEL272:4;
  uint32_t PIXEL271:4;
  uint32_t PIXEL270:4;
} __GLCDCURDATA108bits_t;
extern volatile __GLCDCURDATA108bits_t GLCDCURDATA108bits __asm__ ("GLCDCURDATA108") __attribute__((section("sfrs"), address(0xBF8EA9B0)));
#define GLCDCURDATA109 GLCDCURDATA109
extern volatile uint32_t   GLCDCURDATA109 __attribute__((section("sfrs"), address(0xBF8EA9B4)));
typedef struct {
  uint32_t PIXEL2715:4;
  uint32_t PIXEL2714:4;
  uint32_t PIXEL2713:4;
  uint32_t PIXEL2712:4;
  uint32_t PIXEL2711:4;
  uint32_t PIXEL2710:4;
  uint32_t PIXEL279:4;
  uint32_t PIXEL278:4;
} __GLCDCURDATA109bits_t;
extern volatile __GLCDCURDATA109bits_t GLCDCURDATA109bits __asm__ ("GLCDCURDATA109") __attribute__((section("sfrs"), address(0xBF8EA9B4)));
#define GLCDCURDATA110 GLCDCURDATA110
extern volatile uint32_t   GLCDCURDATA110 __attribute__((section("sfrs"), address(0xBF8EA9B8)));
typedef struct {
  uint32_t PIXEL2723:4;
  uint32_t PIXEL2722:4;
  uint32_t PIXEL2721:4;
  uint32_t PIXEL2720:4;
  uint32_t PIXEL2719:4;
  uint32_t PIXEL2718:4;
  uint32_t PIXEL2717:4;
  uint32_t PIXEL2716:4;
} __GLCDCURDATA110bits_t;
extern volatile __GLCDCURDATA110bits_t GLCDCURDATA110bits __asm__ ("GLCDCURDATA110") __attribute__((section("sfrs"), address(0xBF8EA9B8)));
#define GLCDCURDATA111 GLCDCURDATA111
extern volatile uint32_t   GLCDCURDATA111 __attribute__((section("sfrs"), address(0xBF8EA9BC)));
typedef struct {
  uint32_t PIXEL2731:4;
  uint32_t PIXEL2730:4;
  uint32_t PIXEL2729:4;
  uint32_t PIXEL2728:4;
  uint32_t PIXEL2727:4;
  uint32_t PIXEL2726:4;
  uint32_t PIXEL2725:4;
  uint32_t PIXEL2724:4;
} __GLCDCURDATA111bits_t;
extern volatile __GLCDCURDATA111bits_t GLCDCURDATA111bits __asm__ ("GLCDCURDATA111") __attribute__((section("sfrs"), address(0xBF8EA9BC)));
#define GLCDCURDATA112 GLCDCURDATA112
extern volatile uint32_t   GLCDCURDATA112 __attribute__((section("sfrs"), address(0xBF8EA9C0)));
typedef struct {
  uint32_t PIXEL287:4;
  uint32_t PIXEL286:4;
  uint32_t PIXEL285:4;
  uint32_t PIXEL284:4;
  uint32_t PIXEL283:4;
  uint32_t PIXEL282:4;
  uint32_t PIXEL281:4;
  uint32_t PIXEL280:4;
} __GLCDCURDATA112bits_t;
extern volatile __GLCDCURDATA112bits_t GLCDCURDATA112bits __asm__ ("GLCDCURDATA112") __attribute__((section("sfrs"), address(0xBF8EA9C0)));
#define GLCDCURDATA113 GLCDCURDATA113
extern volatile uint32_t   GLCDCURDATA113 __attribute__((section("sfrs"), address(0xBF8EA9C4)));
typedef struct {
  uint32_t PIXEL2815:4;
  uint32_t PIXEL2814:4;
  uint32_t PIXEL2813:4;
  uint32_t PIXEL2812:4;
  uint32_t PIXEL2811:4;
  uint32_t PIXEL2810:4;
  uint32_t PIXEL289:4;
  uint32_t PIXEL288:4;
} __GLCDCURDATA113bits_t;
extern volatile __GLCDCURDATA113bits_t GLCDCURDATA113bits __asm__ ("GLCDCURDATA113") __attribute__((section("sfrs"), address(0xBF8EA9C4)));
#define GLCDCURDATA114 GLCDCURDATA114
extern volatile uint32_t   GLCDCURDATA114 __attribute__((section("sfrs"), address(0xBF8EA9C8)));
typedef struct {
  uint32_t PIXEL2823:4;
  uint32_t PIXEL2822:4;
  uint32_t PIXEL2821:4;
  uint32_t PIXEL2820:4;
  uint32_t PIXEL2819:4;
  uint32_t PIXEL2818:4;
  uint32_t PIXEL2817:4;
  uint32_t PIXEL2816:4;
} __GLCDCURDATA114bits_t;
extern volatile __GLCDCURDATA114bits_t GLCDCURDATA114bits __asm__ ("GLCDCURDATA114") __attribute__((section("sfrs"), address(0xBF8EA9C8)));
#define GLCDCURDATA115 GLCDCURDATA115
extern volatile uint32_t   GLCDCURDATA115 __attribute__((section("sfrs"), address(0xBF8EA9CC)));
typedef struct {
  uint32_t PIXEL2831:4;
  uint32_t PIXEL2830:4;
  uint32_t PIXEL2829:4;
  uint32_t PIXEL2828:4;
  uint32_t PIXEL2827:4;
  uint32_t PIXEL2826:4;
  uint32_t PIXEL2825:4;
  uint32_t PIXEL2824:4;
} __GLCDCURDATA115bits_t;
extern volatile __GLCDCURDATA115bits_t GLCDCURDATA115bits __asm__ ("GLCDCURDATA115") __attribute__((section("sfrs"), address(0xBF8EA9CC)));
#define GLCDCURDATA116 GLCDCURDATA116
extern volatile uint32_t   GLCDCURDATA116 __attribute__((section("sfrs"), address(0xBF8EA9D0)));
typedef struct {
  uint32_t PIXEL297:4;
  uint32_t PIXEL296:4;
  uint32_t PIXEL295:4;
  uint32_t PIXEL294:4;
  uint32_t PIXEL293:4;
  uint32_t PIXEL292:4;
  uint32_t PIXEL291:4;
  uint32_t PIXEL290:4;
} __GLCDCURDATA116bits_t;
extern volatile __GLCDCURDATA116bits_t GLCDCURDATA116bits __asm__ ("GLCDCURDATA116") __attribute__((section("sfrs"), address(0xBF8EA9D0)));
#define GLCDCURDATA117 GLCDCURDATA117
extern volatile uint32_t   GLCDCURDATA117 __attribute__((section("sfrs"), address(0xBF8EA9D4)));
typedef struct {
  uint32_t PIXEL2915:4;
  uint32_t PIXEL2914:4;
  uint32_t PIXEL2913:4;
  uint32_t PIXEL2912:4;
  uint32_t PIXEL2911:4;
  uint32_t PIXEL2910:4;
  uint32_t PIXEL299:4;
  uint32_t PIXEL298:4;
} __GLCDCURDATA117bits_t;
extern volatile __GLCDCURDATA117bits_t GLCDCURDATA117bits __asm__ ("GLCDCURDATA117") __attribute__((section("sfrs"), address(0xBF8EA9D4)));
#define GLCDCURDATA118 GLCDCURDATA118
extern volatile uint32_t   GLCDCURDATA118 __attribute__((section("sfrs"), address(0xBF8EA9D8)));
typedef struct {
  uint32_t PIXEL2923:4;
  uint32_t PIXEL2922:4;
  uint32_t PIXEL2921:4;
  uint32_t PIXEL2920:4;
  uint32_t PIXEL2919:4;
  uint32_t PIXEL2918:4;
  uint32_t PIXEL2917:4;
  uint32_t PIXEL2916:4;
} __GLCDCURDATA118bits_t;
extern volatile __GLCDCURDATA118bits_t GLCDCURDATA118bits __asm__ ("GLCDCURDATA118") __attribute__((section("sfrs"), address(0xBF8EA9D8)));
#define GLCDCURDATA119 GLCDCURDATA119
extern volatile uint32_t   GLCDCURDATA119 __attribute__((section("sfrs"), address(0xBF8EA9DC)));
typedef struct {
  uint32_t PIXEL2931:4;
  uint32_t PIXEL2930:4;
  uint32_t PIXEL2929:4;
  uint32_t PIXEL2928:4;
  uint32_t PIXEL2927:4;
  uint32_t PIXEL2926:4;
  uint32_t PIXEL2925:4;
  uint32_t PIXEL2924:4;
} __GLCDCURDATA119bits_t;
extern volatile __GLCDCURDATA119bits_t GLCDCURDATA119bits __asm__ ("GLCDCURDATA119") __attribute__((section("sfrs"), address(0xBF8EA9DC)));
#define GLCDCURDATA120 GLCDCURDATA120
extern volatile uint32_t   GLCDCURDATA120 __attribute__((section("sfrs"), address(0xBF8EA9E0)));
typedef struct {
  uint32_t PIXEL307:4;
  uint32_t PIXEL306:4;
  uint32_t PIXEL305:4;
  uint32_t PIXEL304:4;
  uint32_t PIXEL303:4;
  uint32_t PIXEL302:4;
  uint32_t PIXEL301:4;
  uint32_t PIXEL300:4;
} __GLCDCURDATA120bits_t;
