Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz2025dab176.h
#define _SQI1INTSIGEN_BDDONEISE_POSITION         0x00000009
#define _SQI1INTSIGEN_BDDONEISE_MASK             0x00000200
#define _SQI1INTSIGEN_BDDONEISE_LENGTH           0x00000001

#define _SQI1INTSIGEN_PKTCOMPISE_POSITION        0x0000000A
#define _SQI1INTSIGEN_PKTCOMPISE_MASK            0x00000400
#define _SQI1INTSIGEN_PKTCOMPISE_LENGTH          0x00000001

#define _SQI1INTSIGEN_DMAEISE_POSITION           0x0000000B
#define _SQI1INTSIGEN_DMAEISE_MASK               0x00000800
#define _SQI1INTSIGEN_DMAEISE_LENGTH             0x00000001

#define _SQI1TAPCON_CLKOUTDLY_POSITION           0x00000000
#define _SQI1TAPCON_CLKOUTDLY_MASK               0x0000000F
#define _SQI1TAPCON_CLKOUTDLY_LENGTH             0x00000004

#define _SQI1TAPCON_DATAOUTDLY_POSITION          0x00000004
#define _SQI1TAPCON_DATAOUTDLY_MASK              0x000000F0
#define _SQI1TAPCON_DATAOUTDLY_LENGTH            0x00000004

#define _SQI1TAPCON_SDRCLKINDLY_POSITION         0x00000008
#define _SQI1TAPCON_SDRCLKINDLY_MASK             0x00003F00
#define _SQI1TAPCON_SDRCLKINDLY_LENGTH           0x00000006

#define _SQI1TAPCON_DDRDATINDLY_POSITION         0x00000010
#define _SQI1TAPCON_DDRDATINDLY_MASK             0x000F0000
#define _SQI1TAPCON_DDRDATINDLY_LENGTH           0x00000004

#define _SQI1TAPCON_SDRDATINDLY_POSITION         0x00000014
#define _SQI1TAPCON_SDRDATINDLY_MASK             0x00F00000
#define _SQI1TAPCON_SDRDATINDLY_LENGTH           0x00000004

#define _SQI1TAPCON_DDRCLKINDLY_POSITION         0x00000018
#define _SQI1TAPCON_DDRCLKINDLY_MASK             0x3F000000
#define _SQI1TAPCON_DDRCLKINDLY_LENGTH           0x00000006

#define _SQI1MEMSTAT_STATCMD_POSITION            0x00000000
#define _SQI1MEMSTAT_STATCMD_MASK                0x0000FFFF
#define _SQI1MEMSTAT_STATCMD_LENGTH              0x00000010

#define _SQI1MEMSTAT_STATBYTES_POSITION          0x00000010
#define _SQI1MEMSTAT_STATBYTES_MASK              0x00030000
#define _SQI1MEMSTAT_STATBYTES_LENGTH            0x00000002

#define _SQI1MEMSTAT_STATTYPE_POSITION           0x00000012
#define _SQI1MEMSTAT_STATTYPE_MASK               0x000C0000
#define _SQI1MEMSTAT_STATTYPE_LENGTH             0x00000002

#define _SQI1MEMSTAT_STATPOS_POSITION            0x00000014
#define _SQI1MEMSTAT_STATPOS_MASK                0x00100000
#define _SQI1MEMSTAT_STATPOS_LENGTH              0x00000001

#define _SQI1XCON3_INIT1CMD1_POSITION            0x00000000
#define _SQI1XCON3_INIT1CMD1_MASK                0x000000FF
#define _SQI1XCON3_INIT1CMD1_LENGTH              0x00000008

#define _SQI1XCON3_INIT1CMD2_POSITION            0x00000008
#define _SQI1XCON3_INIT1CMD2_MASK                0x0000FF00
#define _SQI1XCON3_INIT1CMD2_LENGTH              0x00000008

#define _SQI1XCON3_INIT1CMD3_POSITION            0x00000010
#define _SQI1XCON3_INIT1CMD3_MASK                0x00FF0000
#define _SQI1XCON3_INIT1CMD3_LENGTH              0x00000008

#define _SQI1XCON3_INIT1TYPE_POSITION            0x00000018
#define _SQI1XCON3_INIT1TYPE_MASK                0x03000000
#define _SQI1XCON3_INIT1TYPE_LENGTH              0x00000002

#define _SQI1XCON3_INIT1COUNT_POSITION           0x0000001A
#define _SQI1XCON3_INIT1COUNT_MASK               0x0C000000
#define _SQI1XCON3_INIT1COUNT_LENGTH             0x00000002

#define _SQI1XCON3_INIT1SCHECK_POSITION          0x0000001C
#define _SQI1XCON3_INIT1SCHECK_MASK              0x10000000
#define _SQI1XCON3_INIT1SCHECK_LENGTH            0x00000001

#define _SQI1XCON4_INIT2CMD1_POSITION            0x00000000
#define _SQI1XCON4_INIT2CMD1_MASK                0x000000FF
#define _SQI1XCON4_INIT2CMD1_LENGTH              0x00000008

#define _SQI1XCON4_INIT2CMD2_POSITION            0x00000008
#define _SQI1XCON4_INIT2CMD2_MASK                0x0000FF00
#define _SQI1XCON4_INIT2CMD2_LENGTH              0x00000008

#define _SQI1XCON4_INIT2CMD3_POSITION            0x00000010
#define _SQI1XCON4_INIT2CMD3_MASK                0x00FF0000
#define _SQI1XCON4_INIT2CMD3_LENGTH              0x00000008

#define _SQI1XCON4_INIT2TYPE_POSITION            0x00000018
#define _SQI1XCON4_INIT2TYPE_MASK                0x03000000
#define _SQI1XCON4_INIT2TYPE_LENGTH              0x00000002

#define _SQI1XCON4_INIT2COUNT_POSITION           0x0000001A
#define _SQI1XCON4_INIT2COUNT_MASK               0x0C000000
#define _SQI1XCON4_INIT2COUNT_LENGTH             0x00000002

#define _SQI1XCON4_INIT2SCHECK_POSITION          0x0000001C
#define _SQI1XCON4_INIT2SCHECK_MASK              0x10000000
#define _SQI1XCON4_INIT2SCHECK_LENGTH            0x00000001

#define _USBCSR0_FUNC_POSITION                   0x00000000
#define _USBCSR0_FUNC_MASK                       0x0000007F
#define _USBCSR0_FUNC_LENGTH                     0x00000007

#define _USBCSR0_SUSPEN_POSITION                 0x00000008
#define _USBCSR0_SUSPEN_MASK                     0x00000100
#define _USBCSR0_SUSPEN_LENGTH                   0x00000001

#define _USBCSR0_SUSPMODE_POSITION               0x00000009
#define _USBCSR0_SUSPMODE_MASK                   0x00000200
#define _USBCSR0_SUSPMODE_LENGTH                 0x00000001

#define _USBCSR0_RESUME_POSITION                 0x0000000A
#define _USBCSR0_RESUME_MASK                     0x00000400
#define _USBCSR0_RESUME_LENGTH                   0x00000001

#define _USBCSR0_RESET_POSITION                  0x0000000B
#define _USBCSR0_RESET_MASK                      0x00000800
#define _USBCSR0_RESET_LENGTH                    0x00000001

#define _USBCSR0_HSMODE_POSITION                 0x0000000C
#define _USBCSR0_HSMODE_MASK                     0x00001000
#define _USBCSR0_HSMODE_LENGTH                   0x00000001

#define _USBCSR0_HSEN_POSITION                   0x0000000D
#define _USBCSR0_HSEN_MASK                       0x00002000
#define _USBCSR0_HSEN_LENGTH                     0x00000001

#define _USBCSR0_SOFTCONN_POSITION               0x0000000E
#define _USBCSR0_SOFTCONN_MASK                   0x00004000
#define _USBCSR0_SOFTCONN_LENGTH                 0x00000001

#define _USBCSR0_ISOUPD_POSITION                 0x0000000F
#define _USBCSR0_ISOUPD_MASK                     0x00008000
#define _USBCSR0_ISOUPD_LENGTH                   0x00000001

#define _USBCSR0_EP0IF_POSITION                  0x00000010
#define _USBCSR0_EP0IF_MASK                      0x00010000
#define _USBCSR0_EP0IF_LENGTH                    0x00000001

